In [1]:
import pandas as pd

from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier

In [13]:
df  = pd.read_csv("salaries.csv")
df.shape

(16, 4)

In [4]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [5]:
len(df)

16

In [6]:
df["degree"].value_counts()

degree
bachelors    8
masters      8
Name: count, dtype: int64

In [7]:
df["job"].value_counts()

job
business manager       6
sales executive        5
computer programmer    5
Name: count, dtype: int64

In [8]:
df["company"].value_counts()

company
google        6
facebook      6
abc pharma    4
Name: count, dtype: int64

In [20]:
df["degree_number"] = df["degree"].map({"bachelors" : 0 , "masters" : 1} )
df.drop(["degree"] , axis = 1 , inplace = True)

In [21]:
df.head()

  company                  job  salary_more_then_100k  degree_number
0  google      sales executive                      0              0
1  google      sales executive                      0              1
2  google     business manager                      1              0
3  google     business manager                      1              1
4  google  computer programmer                      0              0

In [23]:
df = pd.get_dummies(df , columns = ["job"] , drop_first  = True)

In [24]:
df = pd.get_dummies(df , columns = ["company"] , drop_first  = True)

In [25]:
df.head()

,salary_more_then_100k,degree_number,job_computer programmer,job_sales executive,company_facebook,company_google
0,0,0,False,True,False,True
1,0,1,False,True,False,True
2,1,0,False,False,False,True
3,1,1,False,False,False,True
4,0,0,True,False,False,True

In [26]:
X = df.drop(["salary_more_then_100k"] , axis  = 1)
y = df["salary_more_then_100k"]

X_train , X_test , y_train , y_test  = train_test_split(X , y , test_size = 0.2 , random_state = 42)
D_model =  DecisionTreeClassifier(criterion='gini')

D_model.fit(X_train , y_train)

y_predict  = D_model.predict(X_test)

In [28]:
from sklearn.metrics import classification_report

print(classification_report(y_predict , y_test))

              precision    recall  f1-score   support

           0       0.00      0.00      0.00         1
           1       0.50      0.33      0.40         3

    accuracy                           0.25         4
   macro avg       0.25      0.17      0.20         4
weighted avg       0.38      0.25      0.30         4